app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "coding"], ["room_number", 101], ["created_at", "2021-01-19 00:15:55.511044"], ["updated_at", "2021-01-19 00:15:55.511044"]]
---
    def create
        @school_class = SchoolClass.create(school_classes_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "coding 101"], ["room_number", 700], ["updated_at", "2021-01-19 00:29:22.683003"], ["id", 4]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_classes_params)